<?php
/**
 * @package admin
 * @copyright Copyright 2003-2016 Zen Cart Development Team
 * @copyright Portions Copyright 2003 osCommerce
 * @license http://www.zen-cart.com/license/2_0.txt GNU Public License V2.0
 * @version $Id: admin_activity.php drbyte Modified in v1.5.5 $
 */

define('HEADING_TITLE', 'Мениджър активността на администратора');
define('HEADING_SUB1', 'Прегледай или експортирай записи');
define('HEADING_SUB2', 'Purge Log History');
define('TEXT_ACTIVITY_EXPORT_FORMAT', 'Файлов формат на експорта:');
define('TEXT_ACTIVITY_EXPORT_FILENAME', 'Файлово име на експорта:');
define('TEXT_ACTIVITY_EXPORT_SAVETOFILE','Съхрани на файл в сървъра? (или ще се подаде за сваляне директно от този прозорец)');
define('TEXT_ACTIVITY_EXPORT_DEST','Дестинация: ');
define('TEXT_PROCESSED', ' Обработено.');
define('SUCCESS_EXPORT_ADMIN_ACTIVITY_LOG', 'Експортирането завършено. ');
define('FAILURE_EXPORT_ADMIN_ACTIVITY_LOG', 'Внимание: Експортирането неуспешно. Неможе да запише файл ');

define('TEXT_INSTRUCTIONS','<u>Инструкции</u><br />Можете да използвате тази страница, за да експортирате активността на администраторите в своя Zen Cart&reg; във файлов формат CSV за архив.<br />Запазете архивите в случай, че сайтът Ви е компроментиран и са извършени измами. Това е според изискване съгласно PCI.<br />
<ol><li>Изберете дали да прегледате или експортирате към файл.<li>Въведете файлово име.<li>Натиснете Съхрани за да продължите.<li>Изберете дали да запишете или отворите файла, в зависимост от това, което предлага Вашия браузър.</ol>');

define('TEXT_INFO_ADMIN_ACTIVITY_LOG', '<strong>Изпразни Записите са активността на администраторите от базата данни<br />Внимание: УВЕРЕТЕ СЕ, ЧЕ ИМАТЕ РЕЗЕРВНО КОПИЕ НА БАЗАТА ДАННИ, преди да направите това обновление!</strong><br />Записът на активността на администраторите, е метод за проследяване на активността в Админ панела. <br />Поради това, той може да стане много голям, за кратко време и има нужда да бъде почистван периодично.<br />Предупреждения се дават за всеки 50,000 записа или 60 дни - което се случи по-рано.<br /><span class="alert">Забележка: Съгласно PCI, би трябвало да съхранявате запис за активността на администраторите за последните 12 месеца.<br />Най-добре е да архивирате записите, като изберете ЕКСПОРТИРАЙ В CSV и натиснете Съхрани, по-горе, преди да заличите информацията.</span>');
define('TEXT_ADMIN_LOG_PLEASE_CONFIRM_ERASE', '<strong><span class="alert">Внимание!: На крачка сте от ИЗТРИВАНЕТО на ВАЖНИ следи за проследяване и ревизия от базата данни.</span></strong><br />Би трябвало ПЪРВО да потвърдите, че имате надеждно резервно копие на базата данни.<br />Като продължите, се съгласявате тази информация да бъде заличена и осъзнавате законовите права и задължения относно нея.<br /><br />Разбирам отговорностите си и желая да продължа с изтриването, като натисна Нулирай:<br />');
define('SUCCESS_CLEAN_ADMIN_ACTIVITY_LOG', '<strong>Завършено</strong> заличен е записът на активността на администраторите');
define('TEXT_NO_RECORDS_FOUND', 'Не са намерени записи, според зададените филтри.');

define('TEXT_EXPORTFORMAT0', 'Експортирай в HTML (идеално за директен преглед)');
define('TEXT_EXPORTFORMAT1', 'Експортирай в CSV (идеално за вграждане в spreadsheets)');
define('TEXT_EXPORTFORMAT2', 'Експортирай в TXT');
define('TEXT_EXPORTFORMAT3', 'Експортирай в XML');

define('TEXT_ACTIVITY_EXPORT_FILTER', 'Кои записи искате да видите?');
define('TEXT_EXPORTFILTER0', 'Цялата записана информация, без значение от нивото на важност.');
define('TEXT_EXPORTFILTER1', 'ИНФО - Обща информация за записите');
define('TEXT_EXPORTFILTER2', 'ЗАБЕЛЕЖКА - Информация, която би трябвало да бъде преглеждана периодично');
define('TEXT_EXPORTFILTER3', 'ВНИМАНИЕ - Активност, която трябва да се наблудава ежедневно');
define('TEXT_EXPORTFILTER4', 'И двете ЗАБЕЛЕЖКА и ВНИМАНИЕ (честа комбинация за преглед).');

define('TEXT_INTERPRETING_LOG_DATA', '<p><strong>Интерпретация на информацията в записите</strong><ul>
<li><strong>Важност</strong> - Стандартът за записи обикновено описва важността както следва:
  <ul>
  <li><strong>ИНФО</strong> се отнася за по-обща активност. Това може да съдържа или да не съдържа значими детайли.</li>
  <li><strong>ЗАБЕЛЕЖКА</strong> се отнася за активност от по-високо ниво на достъп, и може да включва действия, като създаването на нови административни потребители и добавянето на нови модули за плащане. Също така маркира, когато е публикувана информация на веб страница, включваща рисково съдържание, като например скриптове или вградени рамки и е възможно да се въведе опасно съдържание в products/categories/pages от недоволни служители или нарушител, проникнал в сайта. Това съдържание би трябвало да се преглежда редовно за потенциални аномалии, като неоторизирани действия.</li>
  <li><strong>ВНИМАНИЕ</strong> се отнася до КРИТИЧНИ събития, като премахване на модули за плащане или изтриване на административни потребители. Това са действия, които предполагат потенциална заплаха, ако не бъдат предотвратени своевременно. Такъв тип съобщения трябва да се преглеждат често; препоръчително ежедневно.</li>
  </ul>
</li>
<li><strong>admin_user</strong> - Това ще покаже ID номера на админа, следване от потребителското име. Ако не е влизано ще покаже 0.</li>
<li><strong>page_accessed</strong> - Това ще маркира имената на посетените страници, следователно давайки съвет за вида на дейност, което се е случила.</li>
<li><strong>parameters</strong> - Това е остатъка от URI на посетената страница и дава по-нататъшни индикации, относно вида на дейностите, които са предприети от посетителя.</li>
<li><strong>flagged</strong> - Ако това дава стойност 1, това дава индикация, че трябва да се провери съдържанието на записите в полето "postdata"  за неоторизирани скриптове, iframe или други потенциално опасно съдържание. Обяснение, относно подозрително съдържание ще бъде публикувано в поле "attention".</li>
<li><strong>attention</strong> - Тук се съдържат препоръки, относно вида на подозрителните дейности, които би трябвало да бъдат разгледани в полето "postdata". </li>
<li><strong>logmessage</strong> - Тук се съдържат съобщения, записани от системата, относно дейости, като инсталирането на определени модули.</li>
<li><strong>postdata</strong> - Тук се съдържа суровата POST информация (с чувствително съдържание) за лесен преглед, в случай че има подозрения за злонамерени действия.</li>
</ul></p>');